Repository: kechkarayoub/Leaguer
Catalog: backend/accounts/locale/*/LC_MESSAGES/django.po
Languages: ar

source: Personal Info
ar: معلومات شخصية

source: Permissions
ar: الصلاحيات

source: Important Dates
ar: تواريخ مهمة

source: Accounts
ar: الحسابات

source: User
ar: مستخدم

source: Users
ar: المستخدمون

source: Current language
ar: اللغة الحالية

source: Email
ar: البريد الإلكتروني

source: First name
ar: الاسم الأول

source: Is active
ar: نشط

source: Is deleted
ar: محذوف

source: Is email validated
ar: هل تم التحقق من البريد الإلكتروني

source: Is phone number validated
ar: هل تم التحقق من رقم الهاتف

source: Last name
ar: اللقب

source: Number of phone number's verification code used
ar: عدد رموز التحقق المستخدمة لرقم الهاتف

source: Address
ar: العنوان

source: Birthday
ar: تاريخ الميلاد

source: CIN
ar: رقم الهوية الوطنية

source: Country
ar: الدولة

source: GENDER
ar: الجنس

source: Image url
ar: رابط الصورة

source: Initials background color
ar: لون خلفية الحروف الأولى

source: Phone number
ar: رقم الهاتف

source: Phone number's verification code
ar: رمز التحقق من رقم الهاتف

source: Phone number's verification code generation date
ar: تاريخ إنشاء رمز التحقق من رقم الهاتف

source: Phone number to verify
ar: رقم الهاتف للتحقق

source: Phone number verified by
ar: تم التحقق من رقم الهاتف بواسطة

source: Time zone
ar: المنطقة الزمنية

source: Invalid phone number.
ar: رقم هاتف غير صالح.

source: Phone number must start with a '+' followed by the country code and the phone number.
ar: يجب أن يبدأ رقم الهاتف بعلامة '+' متبوعة برمز الدولة ورقم الهاتف.

source: The minimum age allowed for users is:
ar: الحد الأدنى للعمر المسموح به للمستخدمين هو:

source: Verify your email address
ar: قم بتأكيد عنوان بريدك الإلكتروني

source: Verify Your Email
ar: تحقق من بريدك الإلكتروني

source: Welcome, %(first_name)s!
ar: مرحبًا، %(first_name)s!

source: Thank you for registering. Please verify your email by clicking the link below:
ar: شكرًا لتسجيلك. يرجى التحقق من بريدك الإلكتروني بالنقر على الرابط أدناه:

source: Verify Email
ar: تحقق من البريد الإلكتروني

source: If you did not sign up for this account, you can safely ignore this email.
ar: إذا لم تقم بالتسجيل لهذا الحساب، يمكنك تجاهل هذا البريد الإلكتروني بأمان.

source: Hello %(first_name)s,
ar: مرحبًا %(first_name)s،

source: Thank you for registering. Please verify your email by clicking the link below:
ar: شكرًا لتسجيلك. يرجى التحقق من بريدك الإلكتروني بالنقر على الرابط أدناه:

source: Password Reset Request
ar: طلب إعادة تعيين كلمة المرور

source: Hello, %(first_name)s!
ar: مرحبًا، %(first_name)s!

source: You have requested to reset your password. Please click the link below to reset your password:
ar: لقد طلبت إعادة تعيين كلمة المرور الخاصة بك. يرجى النقر على الرابط أدناه لإعادة تعيينها:

source: Reset Password
ar: إعادة تعيين كلمة المرور

source: This link will expire in 24 hours.
ar: سينتهي صلاحية هذا الرابط خلال 24 ساعة.

source: If you did not request this password reset, you can safely ignore this email.
ar: إذا لم تطلب إعادة تعيين كلمة المرور هذه، يمكنك تجاهل هذا البريد الإلكتروني بأمان.

source: You have requested to reset your password. Please click the link below to reset your password:
ar: لقد طلبت إعادة تعيين كلمة المرور الخاصة بك. يرجى النقر على الرابط أدناه لإعادة تعيينها:

source: This link will expire in 24 hours.
ar: سينتهي صلاحية هذا الرابط خلال 24 ساعة.

source: If you did not request this password reset, you can safely ignore this email.
ar: إذا لم تطلب إعادة تعيين كلمة المرور هذه، يمكنك تجاهل هذا البريد الإلكتروني بأمان.

source: Your verification code is %(verification_code)s. Please use it to confirm your number. Thank you.
ar: رمز التحقق الخاص بك هو %(verification_code)s. يرجى استخدامه لتأكيد رقمك. شكرًا لك.

source: Select
ar: اختر

source: Female
ar: أنثى

source: Male
ar: ذكر

source: Verify Your Email Address
ar: تحقق من عنوان بريدك الإلكتروني

source: User id is required
ar: مطلوب معرف المستخدم

source: Your email is already verified. Try to sign in.
ar: تم التحقق من بريدك الإلكتروني بالفعل. حاول تسجيل الدخول.

source: Email not sent. Please contact the technical team to resolve your issue.
ar: لم يتم إرسال البريد الإلكتروني. يرجى التواصل مع الفريق التقني لحل مشكلتك.

source: A new verification link has been sent to your email address. Please verify your email before logging in.
ar: تم إرسال رابط تحقق جديد إلى بريدك الإلكتروني. يرجى التحقق من بريدك الإلكتروني قبل تسجيل الدخول.

source: Email/Username and password are required
ar: البريد الإلكتروني/اسم المستخدم وكلمة المرور مطلوبة

source: Your account is deleted. Please contact the technical team to resolve your issue.
ar: تم حذف حسابك. يرجى التواصل مع الفريق التقني لحل مشكلتك.

source: Your account is inactive. Please contact the technical team to resolve your issue.
ar: حسابك غير نشط. يرجى التواصل مع الفريق التقني لحل مشكلتك.

source: Your email is not yet verified. Please verify your email address before sign in.
ar: لم يتم التحقق من بريدك الإلكتروني بعد. يرجى التحقق من بريدك الإلكتروني قبل تسجيل الدخول.

source: Invalid credentials
ar: بيانات الاعتماد غير صحيحة

source: Email, Id token and Third party type are required
ar: البريد الإلكتروني، رمز الهوية ونوع الطرف الثالث مطلوبة

source: Email or username is required
ar: البريد الإلكتروني أو اسم المستخدم مطلوب

source: If an account with this email or username exists, you will receive a password reset link shortly.
ar: إذا كان هناك حساب بهذا البريد الإلكتروني أو اسم المستخدم، ستتلقى رابط إعادة تعيين كلمة المرور قريبًا.

source: All fields are required
ar: جميع الحقول مطلوبة

source: Invalid or expired reset token. Please request a new password reset.
ar: رمز إعادة تعيين كلمة المرور غير صالح أو منتهي الصلاحية. يرجى طلب إعادة تعيين كلمة مرور جديدة.

source: Password has been reset successfully. You can now log in with your new password.
ar: تمت إعادة تعيين كلمة المرور بنجاح. يمكنك الآن تسجيل الدخول باستخدام كلمة المرور الجديدة.

source: An error occurred while resetting your password. Please try again.
ar: حدث خطأ أثناء إعادة تعيين كلمة المرور. يرجى المحاولة مرة أخرى.

source: Your account is created successfully. Log in with your username and password.
ar: تم إنشاء حسابك بنجاح. قم بتسجيل الدخول باستخدام اسم المستخدم وكلمة المرور الخاصة بك.

source: Your account has been successfully created. You can log in once you validate your email via the link sent to your email address.
ar: تم إنشاء حسابك بنجاح. يمكنك تسجيل الدخول بعد تفعيل بريدك الإلكتروني من خلال الرابط المرسل إلى بريدك.

source: We cannot create your account due to the following errors. Please correct them and try again.
ar: تعذر إنشاء حسابك بسبب الأخطاء التالية. يرجى تصحيحها والمحاولة مرة أخرى.

source: Unable to verify your account with the provided third-party credentials. Please check your information or try a different sign-up method.
ar: تعذر التحقق من حسابك باستخدام بيانات الطرف الثالث المقدمة. يرجى التحقق من معلوماتك أو تجربة طريقة تسجيل أخرى.

source: Unable to create or authenticate your account with the provided third-party credentials. Please check your information or try a different sign-up method.
ar: تعذر إنشاء أو توثيق حسابك باستخدام بيانات الطرف الثالث المقدمة. يرجى التحقق من معلوماتك أو تجربة طريقة تسجيل أخرى.

source: Your profile could not be updated due to the errors listed above. Please correct them and try again.
ar: تعذر تحديث ملفك الشخصي بسبب الأخطاء المذكورة أعلاه. يرجى تصحيحها والمحاولة مرة أخرى.

source: Image upload failed.
ar: فشل تحميل الصورة.

source: Your profile has been updated successfully.
ar: تم تحديث ملفك الشخصي بنجاح.

source: Missing required parameters.
ar: المعلمات المطلوبة مفقودة.

source: You should add a phone number before validate it!
ar: يجب عليك إضافة رقم هاتف قبل التحقق منه!

source: This phone number already verified for another user. Please contact the technical service at {technical_service_email} to resolve your problem.
ar: تم التحقق من رقم الهاتف هذا لمستخدم آخر بالفعل. يرجى التواصل مع الخدمة التقنية على {technical_service_email} لحل مشكلتك.

source: Invalid verification code.
ar: رمز التحقق غير صالح.

source: Phone number already verified.
ar: تم التحقق من رقم الهاتف بالفعل.

source: Phone number verified successfully.
ar: تم التحقق من رقم الهاتف بنجاح.

source: A new verification code will be sent to your phone number.
ar: سيتم إرسال رمز تحقق جديد إلى رقم هاتفك.

source: Expired verification code.
ar: رمز التحقق منتهي الصلاحية.

source: Your sms verification code quota has been exceeded. Please contact the technical service at {technical_service_email} to resolve your problem.
ar: تم تجاوز حصة رموز التحقق عبر الرسائل القصيرة الخاصة بك. يرجى التواصل مع الخدمة التقنية على {technical_service_email} لحل مشكلتك.

source: Invalid code.
ar: رمز غير صالح.

source: Invalid verification link.
ar: رابط التحقق غير صالح.

source: Email already verified.
ar: تم التحقق من البريد الإلكتروني بالفعل.

source: Email verified successfully.
ar: تم التحقق من البريد الإلكتروني بنجاح.

source: Expired token. A new verification email will be sent to your email address.
ar: انتهت صلاحية الرمز. سيتم إرسال بريد تحقق جديد إلى بريدك الإلكتروني.

source: Invalid token.
ar: رمز غير صالح.
